zephyrproject-rtos/hal_microchip/include/dt-bindings/pic32c/pic32cm_ls/common/mchp_pinctrl_pinmux_pic32c.h
/*
 * Copyright (c) 2026 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef INCLUDE_DT_BINDINGS_PIC32CM_LS_COMMON_MCHP_PINCTRL_PINMUX_PIC32C_H_
#define INCLUDE_DT_BINDINGS_PIC32CM_LS_COMMON_MCHP_PINCTRL_PINMUX_PIC32C_H_

/** PORT */
#define MCHP_PINMUX_PORT_a 0U
#define MCHP_PINMUX_PORT_b 1U

/** GPIO */
#define MCHP_PINMUX_PERIPH_gpio 0U

/** Peripherals */
#define MCHP_PINMUX_PERIPH_a 0U
#define MCHP_PINMUX_PERIPH_b 1U
#define MCHP_PINMUX_PERIPH_c 2U
#define MCHP_PINMUX_PERIPH_d 3U
#define MCHP_PINMUX_PERIPH_e 4U
#define MCHP_PINMUX_PERIPH_f 5U
#define MCHP_PINMUX_PERIPH_g 6U
#define MCHP_PINMUX_PERIPH_h 7U
#define MCHP_PINMUX_PERIPH_i 8U
#define MCHP_PINMUX_PERIPH_j 9U
#define MCHP_PINMUX_PERIPH_k 10U
#define MCHP_PINMUX_PERIPH_p 15U

/** Extra */
#define MCHP_PINMUX_PERIPH_x 0U

/** System */
#define MCHP_PINMUX_PERIPH_s 0U

/** LPM */
#define MCHP_PINMUX_PERIPH_lpm 0U

/** Wake-up pin sources */
#define MCHP_PINMUX_PERIPH_wkup0 0U
#define MCHP_PINMUX_PERIPH_wkup1 1U

/** Selects pin to be used as GPIO */
#define MCHP_PINMUX_FUNC_gpio 0U
/** Selects pin to be used as by some peripheral */
#define MCHP_PINMUX_FUNC_periph 1U
/** Selects pin to be used as extra function */
#define MCHP_PINMUX_FUNC_extra 2U
/** Selects pin to be used as system function */
#define MCHP_PINMUX_FUNC_system 3U
/** Selects and configure pin to be used in Low Power Mode */
#define MCHP_PINMUX_FUNC_lpm 4U
/** Selects and configure wake-up pin sources Low Power Mode */
#define MCHP_PINMUX_FUNC_wakeup 5U

/** Pinmux bit field position. */
#define MCHP_PINCTRL_PINMUX_POS (16U)
/** Pinmux bit field mask. */
#define MCHP_PINCTRL_PINMUX_MASK (0xFFFF)

/** Port field mask. */
#define MCHP_PINMUX_PORT_MSK (0xFU)
/** Port field position. */
#define MCHP_PINMUX_PORT_POS (0U)
/** Pin field mask. */
#define MCHP_PINMUX_PIN_MSK (0x1FU)
/** Pin field position. */
#define MCHP_PINMUX_PIN_POS (MCHP_PINMUX_PORT_POS + 4U)
/** Function field mask. */
#define MCHP_PINMUX_FUNC_MSK (0x7U)
/** Function field position. */
#define MCHP_PINMUX_FUNC_POS (MCHP_PINMUX_PIN_POS + 5U)
/** Peripheral field mask. */
#define MCHP_PINMUX_PERIPH_MSK (0xFU)
/** Peripheral field position. */
#define MCHP_PINMUX_PERIPH_POS (MCHP_PINMUX_FUNC_POS + 3U)

/*
 * MCHP pinmux bit field macro:
 * Combines port, pin number, function, and peripheral mux into a single 32-bit value.
 */
#define MCHP_PINMUX(port, pin_num, pin_mux, func)                              \
  ((((MCHP_PINMUX_PORT_##port) & MCHP_PINMUX_PORT_MSK)                         \
    << MCHP_PINMUX_PORT_POS) |                                                 \
   (((pin_num) & MCHP_PINMUX_PIN_MSK) << MCHP_PINMUX_PIN_POS) |                \
   (((MCHP_PINMUX_FUNC_##func) & MCHP_PINMUX_FUNC_MSK)                         \
    << MCHP_PINMUX_FUNC_POS) |                                                 \
   (((MCHP_PINMUX_PERIPH_##pin_mux) & MCHP_PINMUX_PERIPH_MSK)                  \
    << MCHP_PINMUX_PERIPH_POS))

/*
 * Getters used by pinctrl_mchp_port_g1.c
 */
#define MCHP_PINMUX_PIN_GET(pincfg)                                            \
  ((pincfg >> MCHP_PINMUX_PIN_POS) & MCHP_PINMUX_PIN_MSK)
#define MCHP_PINMUX_PORT_GET(pincfg)                                           \
  ((pincfg >> MCHP_PINMUX_PORT_POS) & MCHP_PINMUX_PORT_MSK)
#define MCHP_PINMUX_FUNC_GET(pincfg)                                           \
  ((pincfg >> MCHP_PINMUX_FUNC_POS) & MCHP_PINMUX_FUNC_MSK)
#define MCHP_PINMUX_PERIPH_GET(pincfg)                                         \
  ((pincfg >> MCHP_PINMUX_PERIPH_POS) & MCHP_PINMUX_PERIPH_MSK)

/* SERCOM0 for Curiosity Nano CDC UART */
#define MCHP_PINMUX_PA22_SERCOM0_PAD0 \
	MCHP_PINMUX(a, 22, c, periph)

#define MCHP_PINMUX_PA23_SERCOM0_PAD1 \
	MCHP_PINMUX(a, 23, c, periph)

#endif /* INCLUDE_DT_BINDINGS_PIC32CM_LS_COMMON_MCHP_PINCTRL_PINMUX_PIC32C_H_ */